## 라이브러리

In [1]:
import numpy as np
import pandas as pd

## 데이터 불러오기

In [2]:
#데이터 로드
x_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/HRdata/X_train.csv")
y_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/HRdata/y_train.csv")
x_test= pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/HRdata/X_test.csv")
y_test = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/HRdata/y_test.csv')

display(x_train.head())
display(x_test.head())
display(y_train.head())

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours
0,25298,city_138,0.836,Male,No relevent experience,Full time course,High School,NaN,5,100-500,Pvt Ltd,1,45
1,4241,city_160,0.920,Male,No relevent experience,Full time course,High School,NaN,5,NaN,NaN,1,17
2,24086,city_57,0.866,Male,No relevent experience,no_enrollment,Graduate,STEM,10,NaN,NaN,1,50
3,26773,city_16,0.910,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,>4,135
4,32325,city_143,0.740,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,17

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours
0,7129,city_23,0.899,Male,No relevent experience,no_enrollment,Graduate,STEM,2,NaN,NaN,1,23
1,31037,city_44,0.725,Male,No relevent experience,Part time course,Masters,STEM,5,NaN,NaN,never,39
2,22179,city_103,0.920,Male,No relevent experience,Full time course,Graduate,STEM,7,NaN,NaN,2,262
3,29724,city_50,0.896,Male,No relevent experience,Full time course,Graduate,STEM,7,NaN,NaN,never,78
4,17977,city_149,0.689,Female,Has relevent experience,Full time course,Masters,STEM,19,50-99,Pvt Ltd,1,125

   enrollee_id  target
0        25298     0.0
1         4241     1.0
2        24086     0.0
3        26773     0.0
4        32325     1.0

## EDA

In [3]:
print(x_train.info())
print(y_test.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12452 entries, 0 to 12451
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             12452 non-null  int64
 1   city                    12452 non-null  object
 2   city_development_index  12452 non-null  float64
 3   gender                  9535 non-null   object
 4   relevent_experience     12452 non-null  object
 5   enrolled_university     12195 non-null  object
 6   education_level         12137 non-null  object
 7   major_discipline        10586 non-null  object
 8   experience              12415 non-null  object
 9   company_size            8600 non-null   object
 10  company_type            8471 non-null   object
 11  last_new_job            12179 non-null  object
 12  training_hours          12452 non-null  int64
dtypes: float64(1), int64(2), object(10)
memory usage: 1.2+ MB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6706 entries, 0 to 6705
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   enrollee_id  6706 non-null   int64
 1   target       6706 non-null   float64
dtypes: float64(1), int64(1)
memory usage: 104.9 KB
None

In [4]:
print(x_train.isna().sum())
print('-'*100)
print(x_test.isna().sum())

enrollee_id                  0
city                         0
city_development_index       0
gender                    2917
relevent_experience          0
enrolled_university        257
education_level            315
major_discipline          1866
experience                  37
company_size              3852
company_type              3981
last_new_job               273
training_hours               0
dtype: int64
----------------------------------------------------------------------------------------------------
enrollee_id                  0
city                         0
city_development_index       0
gender                    1591
relevent_experience          0
enrolled_university        129
education_level            145
major_discipline           947
experience                  28
company_size              2086
company_type              2159
last_new_job               150
training_hours               0
dtype: int64

In [5]:
print(x_train.shape, x_test.shape)

(12452, 13) (6706, 13)

### 결측치 처리

In [6]:
# gender
x_train['gender'].value_counts(dropna=False)
x_test['gender'].value_counts(dropna=False)

x_train.loc[x_train['gender'].isna(), 'gender'] = 'Other'
x_test.loc[x_test['gender'].isna(), 'gender'] = 'Other'

print(x_train['gender'].isna().sum(), x_test['gender'].isna().sum())

0 0

In [7]:
# enrolled_university
print(x_train['enrolled_university'].value_counts(dropna=False))
print(x_test['enrolled_university'].value_counts(dropna=False))

x_train.loc[x_train['enrolled_university'].isna(), 'enrolled_university'] = 'no_enrollment'
x_test.loc[x_test['enrolled_university'].isna(), 'enrolled_university'] = 'no_enrollment'

print(x_train['enrolled_university'].isna().sum(), x_test['enrolled_university'].isna().sum())

enrolled_university
no_enrollment       8975
Full time course    2431
Part time course     789
NaN                  257
Name: count, dtype: int64
enrolled_university
no_enrollment       4842
Full time course    1326
Part time course     409
NaN                  129
Name: count, dtype: int64
0 0

In [8]:
# education_level
print(x_train['education_level'].value_counts(dropna=False))
print(x_test['education_level'].value_counts(dropna=False))

x_train.loc[x_train['education_level'].isna(), 'education_level'] = 'High School'
x_test.loc[x_test['education_level'].isna(), 'education_level'] = 'High School'

print(x_train['education_level'].isna().sum(), x_test['education_level'].isna().sum())

education_level
Graduate          7540
Masters           2796
High School       1336
NaN                315
Phd                269
Primary School     196
Name: count, dtype: int64
education_level
Graduate          4058
Masters           1565
High School        681
Phd                145
NaN                145
Primary School     112
Name: count, dtype: int64
0 0

In [9]:
# major_discipline
print(x_train['major_discipline'].value_counts(dropna=False))
print(x_test['major_discipline'].value_counts(dropna=False))

x_train.loc[x_train['major_discipline'].isna(), 'major_discipline'] = 'No Major'
x_test.loc[x_test['major_discipline'].isna(), 'major_discipline'] = 'No Major'

print(x_train['major_discipline'].isna().sum(), x_test['major_discipline'].isna().sum())

major_discipline
STEM               9414
NaN                1866
Humanities          436
Other               248
Business Degree     195
Arts                157
No Major            136
Name: count, dtype: int64
major_discipline
STEM               5078
NaN                 947
Humanities          233
Other               133
Business Degree     132
Arts                 96
No Major             87
Name: count, dtype: int64
0 0

In [10]:
# experience
print(x_train['experience'].value_counts(dropna=False))
print(x_test['experience'].value_counts(dropna=False))

x_train.loc[x_train['experience'].isna(), 'experience'] = '10'
x_test.loc[x_test['experience'].isna(), 'experience'] = '10'

print(x_train['experience'].isna().sum(), x_test['experience'].isna().sum())

experience
>20    2179
4       945
5       926
3       858
6       795
2       713
7       661
9       657
10      633
8       520
15      470
11      428
14      368
1       354
16      334
<1      331
12      317
13      260
17      224
19      200
18      151
20       91
NaN      37
Name: count, dtype: int64
experience
>20    1107
5       504
3       496
4       458
6       421
2       414
7       367
10      352
9       323
8       282
11      236
14      218
15      216
1       195
<1      191
12      177
16      174
13      139
18      129
17      118
19      104
20       57
NaN      28
Name: count, dtype: int64
0 0

In [11]:
# company_size
print(x_train['company_size'].unique())
print(x_train['company_size'].value_counts(dropna=False))
print(x_test['company_size'].value_counts(dropna=False))

x_train.loc[x_train['company_size'].isna(), 'company_size'] = '1000-4999'
x_test.loc[x_test['company_size'].isna(), 'company_size'] = '1000-4999'

print(x_train['company_size'].isna().sum(), x_test['company_size'].isna().sum())

['100-500' nan '50-99' '10/49' '10000+' '1000-4999' '<10' '500-999'
 '5000-9999']
company_size
NaN          3852
50-99        2000
100-500      1672
10000+       1337
10/49         947
1000-4999     852
<10           838
500-999       599
5000-9999     355
Name: count, dtype: int64
company_size
NaN          2086
50-99        1083
100-500       899
10000+        682
10/49         524
1000-4999     476
<10           470
500-999       278
5000-9999     208
Name: count, dtype: int64
0 0

In [12]:
# company_type
print(x_train['company_type'].unique())
print(x_train['company_type'].value_counts(dropna=False))
print(x_test['company_type'].value_counts(dropna=False))

x_train.loc[x_train['company_type'].isna(), 'company_type'] = 'Other'
x_test.loc[x_test['company_type'].isna(), 'company_type'] = 'Other'

print(x_train['company_type'].isna().sum(), x_test['company_type'].isna().sum())

['Pvt Ltd' nan 'Public Sector' 'NGO' 'Funded Startup'
 'Early Stage Startup' 'Other']
company_type
Pvt Ltd                6413
NaN                    3981
Funded Startup          652
Public Sector           620
Early Stage Startup     365
NGO                     340
Other                    81
Name: count, dtype: int64
company_type
Pvt Ltd                3404
NaN                    2159
Funded Startup          349
Public Sector           335
Early Stage Startup     238
NGO                     181
Other                    40
Name: count, dtype: int64
0 0

In [13]:
# last_new_job
print(x_train['last_new_job'].unique())
print(x_train['last_new_job'].value_counts(dropna=False))
print(x_test['last_new_job'].value_counts(dropna=False))

x_train.loc[x_train['last_new_job'].isna(), 'last_new_job'] = '2'
x_test.loc[x_test['last_new_job'].isna(), 'last_new_job'] = '2'

print(x_train['last_new_job'].isna().sum(), x_test['last_new_job'].isna().sum())

['1' '>4' 'never' '2' '4' '3' nan]
last_new_job
1        5157
>4       2182
2        1895
never    1584
3         685
4         676
NaN       273
Name: count, dtype: int64
last_new_job
1        2883
>4       1108
2        1005
never     868
4         353
3         339
NaN       150
Name: count, dtype: int64
0 0

In [14]:
print(x_train.isna().sum())
print('-'*100)
print(x_test.isna().sum())

enrollee_id               0
city                      0
city_development_index    0
gender                    0
relevent_experience       0
enrolled_university       0
education_level           0
major_discipline          0
experience                0
company_size              0
company_type              0
last_new_job              0
training_hours            0
dtype: int64
----------------------------------------------------------------------------------------------------
enrollee_id               0
city                      0
city_development_index    0
gender                    0
relevent_experience       0
enrolled_university       0
education_level           0
major_discipline          0
experience                0
company_size              0
company_type              0
last_new_job              0
training_hours            0
dtype: int64

In [15]:
# enrollee_id는 모델학습에 필요없으므로 파일 저장을 위해 따로 Series로 저장
id = x_test['enrollee_id']

In [16]:
# 데이터 형태
print(x_train.shape, x_test.shape, y_train.shape)

(12452, 13) (6706, 13) (12452, 2)

In [17]:
# x에 같은 처리를 하기 위해 합쳐서 처리
dfX = pd.concat([x_train, x_test])

# x, y enrollee_id drop
dfX.drop(columns=['enrollee_id'], inplace=True)
y_train.drop(columns=['enrollee_id'], inplace=True)

# dfX에서 수치형 데이터로 변경하기(city, gender, relevent_experience ,enrolled_university, education_level, major_discipline, experience, company_size, company_type, last_new_job)
lst = ['city', 'gender', 'relevent_experience' ,'enrolled_university', 'education_level', 'major_discipline', 'experience', 'company_size', 'company_type', 'last_new_job']
for i in lst:
    dfX[i] = dfX[i].astype('category').cat.codes

display(dfX.head())
print(dfX.info())

,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours
0,31,0.836,1,1,0,1,3,15,1,5,0,45
1,49,0.920,1,1,0,1,3,15,2,3,0,17
2,89,0.866,1,1,2,0,5,1,2,3,0,50
3,48,0.910,1,0,2,0,5,21,4,5,4,135
4,37,0.740,2,1,0,0,5,15,2,3,5,17

<class 'pandas.core.frame.DataFrame'>
Index: 19158 entries, 0 to 6705
Data columns (total 12 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   city                    19158 non-null  int8
 1   city_development_index  19158 non-null  float64
 2   gender                  19158 non-null  int8
 3   relevent_experience     19158 non-null  int8
 4   enrolled_university     19158 non-null  int8
 5   education_level         19158 non-null  int8
 6   major_discipline        19158 non-null  int8
 7   experience              19158 non-null  int8
 8   company_size            19158 non-null  int8
 9   company_type            19158 non-null  int8
 10  last_new_job            19158 non-null  int8
 11  training_hours          19158 non-null  int64
dtypes: float64(1), int64(1), int8(10)
memory usage: 636.1 KB
None

In [18]:
# MinMaxScaler
from sklearn.preprocessing import MinMaxScaler
target = ['city_development_index', 'training_hours']
mmscaler = MinMaxScaler()
dfX[target] = mmscaler.fit_transform(dfX[target])
print(dfX.head())

   city  city_development_index  gender  relevent_experience
0    31                0.774451       1                    1  \
1    49                0.942116       1                    1
2    89                0.834331       1                    1
3    48                0.922156       1                    0
4    37                0.582834       2                    1

   enrolled_university  education_level  major_discipline  experience
0                    0                1                 3          15  \
1                    0                1                 3          15
2                    2                0                 5           1
3                    2                0                 5          21
4                    0                0                 5          15

   company_size  company_type  last_new_job  training_hours
0             1             5             0        0.131343
1             2             3             0        0.047761
2             2             3             0        0.146269
3             4             5             4        0.400000
4             2             3             5        0.047761

In [19]:
# 각각 (12452, 13) (6706, 13)로 다시 분리
# id를 drop했기 때문에 column은 12
x_train0 = dfX.iloc[:12452]
x_test0 = dfX.iloc[12452:]
print(x_train0.shape, x_test0.shape)

(12452, 12) (6706, 12)

## 모델링

In [29]:
# train 데이터를 7:3의 비율로 분할
from sklearn.model_selection import train_test_split
x_tr, x_ts, y_tr, y_ts = train_test_split(x_train0, y_train, test_size=0.3, random_state=12)
print(x_tr.shape, x_ts.shape, y_tr.shape, y_ts.shape)

(8716, 12) (3736, 12) (8716, 1) (3736, 1)

In [30]:
# 모델 생성
from sklearn.ensemble import RandomForestClassifier
model = RandomForestClassifier(random_state=1234)
model.fit(x_tr, y_tr)
print(model.score(x_tr, y_tr), model.score(x_ts, y_ts))

C:\Users\hw981\AppData\Local\Temp\ipykernel_1904\3943311232.py:3: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  model.fit(x_tr, y_tr)

0.9988526847177605 0.7839935760171306

###

In [40]:
# 예측
pred = model.predict(x_test0)
proba = model.predict_proba(x_test0)
result = pd.DataFrame({'predict':pred})
# print(result)
# print(proba)
result2 = pd.DataFrame({0:proba[:,0], 1:proba[:,1]})
print(result2)

         0     1
0     0.63  0.37
1     0.54  0.46
2     0.66  0.34
3     0.50  0.50
4     0.87  0.13
...    ...   ...
6701  0.92  0.08
6702  0.40  0.60
6703  0.87  0.13
6704  0.57  0.43
6705  0.53  0.47

[6706 rows x 2 columns]

In [ ]:
# 제출파일 생성
# result.to_csv('submission.csv', index=False)
# result2.to_csv('submission.csv', index=False)

In [46]:
# 실제 예측 비교
real = pd.concat([result, y_test[['target']]], axis=1)
(real['predict']==real['target']).sum() # 맞춘 개수 5762개
print("정답 비율:", (5762/6706)*100)

정답 비율: 85.9230539815091

###